<?php

namespace LinkSms\Library;

class ErrorMap
{
    const ErrMap = [
        'BatchSend2' => [
            -1 => '账号未注册',
            -2 => '其他错误',
            -3 => '帐号或密码错误',
            -5 => '余额不足，请充值',
            -6 => '定时发送时间不是有效的时间格式',
            -7 => '提交信息末尾未签名，请添加中文的企业签名【 】',
            -8 => '发送内容需在1到300字之间',
            -9 => '发送号码为空',
            -10 => '定时时间不能小于系统当前时间',
            -100 => 'IP黑名单',
            -102 => '账号黑名单',
            -103 => 'IP未导白',
        ],
        'Get' => [
            -1 => '账号未注册',
            -2 => '其他错误',
            -3 => '密码错误',
            -100 => 'IP黑名单',
            -101 => '调用接口频率过快(大于30s调用一次)',
            -102 => '账号黑名单',
            -103 => 'IP未导白',
        ],
        'SelSum' => [
            -1 => '账号未注册',
            -2 => '其他错误',
            -3 => '密码错误',
            -100 => 'IP黑名单',
            -101 => '调用接口频率过快(大于30s调用一次)',
            -102 => '账号黑名单',
            -103 => 'IP未导白',
        ]
    ];

    public static function getMessage(string $apiName, int $code): string
    {
        return self::ErrMap[$apiName][$code] ?? '未知错误';
    }
}